clean_demo/app/controllers/application_controller.rb

  def set_current_user
    @current_user ||= User.first || create_demo_user
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]