demo/app/controllers/books_controller.rb

  def index
    @books = current_user.books.page(params[:page])
---
SELECT "books".* FROM "books"